app/views/publications/_form.html.erb

SELECT "categories".* FROM "categories"
---
    <%= form.label :category_id, "Category" %>
    <%= form.collection_select :category_id, Category.all, :id, :name, prompt: "Select a Category" %>