app/views/publications/index.html.erb

SELECT "categories".* FROM "categories"
---
  <label for="category" class="block text-gray-700 font-semibold">Filter by category:</label>
  <%= select_tag :category, options_from_collection_for_select(Category.all, :id, :name), include_blank: true, class: "mt-1 block w-full p-2 border border-gray-300 rounded-md focus:outline-none focus:ring focus:border-blue-300" %>