app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    if @category.save
---
INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "sport"], ["created_at", "2024-11-15 16:27:01.092718"], ["updated_at", "2024-11-15 16:27:01.092718"]]