app/controllers/comments_controller.rb

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @publication = Publication.find(params[:publication_id])

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("content", "created_at", "updated_at", "publication_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["content", "vvv"], ["created_at", "2024-11-15 18:22:27.646039"], ["updated_at", "2024-11-15 18:22:27.646039"], ["publication_id", 1]]
---
  def create
    @publication = Publication.find(params[:publication_id])
    @comment = @publication.comments.build(comment_params)

    if @comment.save

SELECT "comments".* FROM "comments" WHERE "comments"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
  def set_comment
    @comment = Comment.find(params[:id])

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_publication
    @publication = Publication.find_by(id: params[:publication_id])