app/controllers/publications_controller.rb

  def index
    # Filtrar por categoría si el parámetro :category está presente
    @publications = Publication.all
    @publications = @publications.where(category_id: params[:category]) if params[:category].present?
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."category" = $1  [["category", "erere"]]

  def set_publication
    @publication = Publication.find(params[:id])
---
SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]