app/controllers/publications_controller.rb

SELECT "categories".* FROM "categories"
SELECT "publications".* FROM "publications" WHERE "publications"."category_id" = $1 AND (created_at >= $2)  [["category_id", 2], [nil, "2024-10-01 00:00:00"]]
SELECT "publications".* FROM "publications" WHERE (created_at >= $1)  [[nil, "2024-10-01 00:00:00"]]
---
  def index
    @publications = if params[:category].present?
                      Publication.where(category_id: params[:category])
                    else
                      Publication.all

INSERT INTO "publications" ("title", "content", "user_id", "created_at", "updated_at", "category_id", "comment_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "sss"], ["content", "sss"], ["user_id", 1], ["created_at", "2024-11-15 16:43:40.523514"], ["updated_at", "2024-11-15 16:43:40.523514"], ["category_id", 1], ["comment_id", nil]]
---
  def create
    @publication = current_user.publications.build(publication_params)

    if @publication.save

DELETE FROM "publications" WHERE "publications"."id" = $1  [["id", 1]]
---
  def destroy
    @publication.destroy!

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "publications" SET "updated_at" = $1, "active" = $2 WHERE "publications"."id" = $3  [["updated_at", "2024-11-15 17:27:47.077310"], ["active", true], ["id", 1]]
---
  def toggle_active
    @publication = Publication.find(params[:id])
    @publication.update(active: !@publication.active)

SELECT "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def set_publication
    @publication = Publication.find(params[:id])